app/views/bookings/_form.html.erb

SELECT `customers`.* FROM `customers`
---
    <%= f.label :customer %><br />
    <%= f.collection_select(:customer_id, Customer.all, :id, :first_name ) %>

SELECT `hotels`.* FROM `hotels`
---
    <%= f.label :hotel %><br />
    <%= f.collection_select(:hotel_id, Hotel.all, :id, :hotel_name ) %>

SELECT `rooms`.* FROM `rooms`
---
    <%= f.label :room %><br />
    <%= f.collection_select(:room_id, Room.all, :id, :room_name ) %>