app/views/bookings/index.html.erb

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 3 LIMIT 1
---
  <tr>
    <td><%= booking.customer.first_name %></td>