app/views/bookings/show.html.erb

  <b>Customer:</b>
  <%= @booking.customer.first_name %>
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 3 LIMIT 1