app/views/orders/_form.html.erb

SELECT `items`.* FROM `items`
---
    <%= f.label :item %><br />
    <%= f.collection_select(:item_id, Item.all, :id, :name ) %>