app/views/rooms/_form.html.erb

SELECT `hotels`.* FROM `hotels`
---
    <%= f.label :hotel %><br />
    <%= f.collection_select(:hotel_id, Hotel.all, :id, :hotel_name ) %>