app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.paginate(page: params[:page])
---
SELECT `bookings`.* FROM `bookings` LIMIT 30 OFFSET 0

  def show
    @booking = Booking.find(params[:id])
---
SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 1 LIMIT 1

  def create
    @booking = Booking.new(params[:booking])
    @booking.save
---
INSERT INTO `bookings` (`booking_date`, `booking_length`, `created_at`, `customer_id`, `hotel_id`, `room_id`, `updated_at`) VALUES ('2013-02-27', 1, '2013-02-18 08:09:55', 1, 1, 1, '2013-02-18 08:09:55')