app/controllers/customers_controller.rb

SELECT COUNT(*) FROM `customers`
SELECT `customers`.* FROM `customers` LIMIT 30 OFFSET 0
---
  def index
    @customers = Customer.paginate(page: params[:page])

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
---
  def show
    @customer = Customer.find(params[:id])

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
---
  def edit
    @customer = Customer.find(params[:id])

INSERT INTO `customers` (`created_at`, `email`, `first_name`, `last_name`, `phone`, `updated_at`) VALUES ('2013-02-18 07:02:47', NULL, NULL, NULL, NULL, '2013-02-18 07:02:47')
---
  def create
    @customer = Customer.new(params[:customer])
    @customer.save

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
UPDATE `customers` SET `password` = 'siva', `secret_question` = 'name', `secret_answer` = 'siva', `updated_at` = '2013-02-22 03:10:13' WHERE `customers`.`id` = 1
---
  def update
    @customer = Customer.find(params[:id])
    @customer.update_attributes(params[:customer])

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
DELETE FROM `customers` WHERE `customers`.`id` = 1
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy