app/controllers/hotels_controller.rb

  def index
    @hotels = Hotel.paginate(page: params[:page])
---
SELECT `hotels`.* FROM `hotels` LIMIT 30 OFFSET 0

  def show
    @hotel = Hotel.find(params[:id])
---
SELECT `hotels`.* FROM `hotels` WHERE `hotels`.`id` = 1 LIMIT 1

  def create
    @hotel = Hotel.new(params[:hotel])
    @hotel.save
---
INSERT INTO `hotels` (`address`, `city`, `created_at`, `email`, `hotel_name`, `phone`, `updated_at`, `website`) VALUES (NULL, NULL, '2013-02-18 06:58:17', NULL, NULL, NULL, '2013-02-18 06:58:17', NULL)

  def destroy
    @hotel = Hotel.find(params[:id])
    @hotel.destroy
---
SELECT `hotels`.* FROM `hotels` WHERE `hotels`.`id` = 1 LIMIT 1
DELETE FROM `hotels` WHERE `hotels`.`id` = 1