app/controllers/items_controller.rb

SELECT COUNT(*) FROM `items`
SELECT `items`.* FROM `items` LIMIT 30 OFFSET 0
---
  def index
    @items = Item.paginate(page: params[:page])

INSERT INTO "items" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 17 Feb 2013 05:52:39 UTC +00:00], ["name", "Idly"], ["price", 15], ["updated_at", Sun, 17 Feb 2013 05:52:39 UTC +00:00]]
---
  def create
    @item = Item.new(params[:item])
    @item.save