app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate(page: params[:page])
---
SELECT COUNT(*) FROM `orders`
SELECT `orders`.* FROM `orders` LIMIT 30 OFFSET 0

  def create
    @order = Order.new(params[:order])
    @order.save
---
INSERT INTO "orders" ("created_at", "item_id", "quantity", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 17 Feb 2013 06:00:46 UTC +00:00], ["item_id", 2], ["quantity", 3], ["updated_at", Sun, 17 Feb 2013 06:00:46 UTC +00:00]]

  def update
    @order = Order.find(params[:id])
    @order.update_attributes(params[:order])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
UPDATE `orders` SET `item_id` = 3, `updated_at` = '2013-02-18 10:49:50' WHERE `orders`.`id` = 1