app/controllers/products_controller.rb

SELECT `products`.* FROM `products` LIMIT 30 OFFSET 0
---
  def index
    @products = Product.paginate(page: params[:page])

INSERT INTO `products` (`brand`, `category`, `created_at`, `description`, `model`, `price`, `subcategory`, `updated_at`) VALUES ('HP', 'Electronics', '2013-02-19 04:12:03', 'Top of the line laptop.', '6240', 35000, 'Laptops', '2013-02-19 04:12:03')
---
  def create
    @product = Product.new(params[:product])
    @product.save