app/controllers/rooms_controller.rb

  def index
    @rooms = Room.paginate(page: params[:page])
---
SELECT `rooms`.* FROM `rooms` LIMIT 30 OFFSET 0

  def show
    @room = Room.find(params[:id])
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1

  def create
    @room = Room.new(params[:room])
    @room.save
---
INSERT INTO `rooms` (`created_at`, `hotel_id`, `room_name`, `room_rate`, `room_type`, `updated_at`) VALUES ('2013-02-18 07:25:04', 4, '101', 3000, '1BR', '2013-02-18 07:25:04')