app/controllers/sales_controller.rb

SELECT `sales`.* FROM `sales` LIMIT 30 OFFSET 0
---
  def index
    @sales = Sale.paginate(page: params[:page])

SELECT `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1
---
  def show
    @sale = Sale.find(params[:id])

SELECT `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1
---
  def edit
    @sale = Sale.find(params[:id])

INSERT INTO `sales` (`created_at`, `credit_card_no`, `customer_id`, `discount`, `product_id`, `quantity`, `updated_at`) VALUES ('2013-02-19 04:15:57', '435', 2, 0, 1, 1, '2013-02-19 04:15:57')
---
  def create
    @sale = Sale.new(params[:sale])
    @sale.save