app/views/sales/_form.html.erb

SELECT `customers`.* FROM `customers`
---
    <%= f.label :customer %><br />
    <%= f.collection_select(:customer_id, Customer.all, :id, :first_name ) %>

SELECT `products`.* FROM `products`
---
    <%= f.label :product %><br />
    <<%= f.collection_select(:product_id, Product.all, :id, :model ) %>