app/views/sales/index.html.erb

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 2 LIMIT 1
---
  <tr>
    <td><%= sale.customer.first_name %></td>