app/views/sales/show.html.erb

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 2 LIMIT 1
---
  <b>Customer:</b>
  <%= @sale.customer.first_name %>